#+title:  Evaluaci贸n de la exposici贸n
#+author: Gunnar Wolf

* Proceso de creaci贸n de un sistema Linux embebido

- Tema presentado por :: Luis Antonio Ugartechea y Enrique Job Calder贸n
- Calificaci贸n global :: Por favor lean todo el archivo para entender de d贸nde
  vienen todos estos n煤meros 

|------------------------+------+--------------------+------+---------|
| Evaluaci贸n  compa帽eros | Peso | Evaluaci贸n docente | Peso | *Total* |
|------------------------+------+--------------------+------+---------|
|                   9.13 |  0.3 |               8.65 |  0.7 |    8.79 |
|------------------------+------+--------------------+------+---------|
#+TBLFM: @2$5=$1*$2+$3*$4;f-2

* Comentarios

Dado que es una presentaci贸n en video, no puedo evaluar /dominio del tema/ y
/presencia/ como lo har铆amos habitualmente. Me centro en las respuestas que
hagan a las preguntas de sus compa帽eros para el primero y en si la presentaci贸n
"suena" le铆da directamente del material que prepararon o expuesta m谩s libremente
para el segundo.


* Evaluaci贸n grupal

|              | 1 | 2 | 3 | 4 | 5 | Total |
|--------------+---+---+---+---+---+-------|
| Originalidad | 0 | 0 | 0 | 2 | 9 |  9.64 |
| Nivel        | 0 | 0 | 2 | 0 | 9 |  9.27 |
| Relevancia   | 0 | 0 | 0 | 3 | 8 |  9.45 |
| Claridad     | 0 | 0 | 3 | 2 | 6 |  8.55 |
| Presencia    | 0 | 1 | 2 | 0 | 8 |  8.73 |
|--------------+---+---+---+---+---+-------|
|              |   |   |   |   |   |  9.13 |
#+TBLFM: @2$7..@6$7=10 * (0.2*$2 + 0.4*$3 + 0.6*$4 + 0.8*$5 + $6 ) / vsum($2..$6); f-2::@7$7=vmean(@2$7..@6$7); f-2

** Comentarios de los compa帽eros

Su exposici贸n recibi贸 los siguientes comentarios anonimizados por
parte de sus compa帽eros:

- niceee
- Ninguno :)

* Evaluaci贸n por parte del docente

| *Aspecto*                          | *Peso* | *Evaluaci贸n* | *Puntos* |
|------------------------------------+--------+--------------+----------|
| Contenido t茅cnico y profundidad    |    0.3 |           10 |       3. |
| Fuentes bibliogr谩ficas             |   0.15 |            7 |     1.05 |
| Organizaci贸n                       |   0.15 |           10 |      1.5 |
| Comunicaci贸n oral y uso del tiempo |   0.25 |           10 |      2.5 |
| Uso de recursos visuales           |   0.15 |            4 |      0.6 |
|------------------------------------+--------+--------------+----------|
| *Global*                           |        |              |     8.65 |
#+TBLFM: @<<$4..@>>$4=$2*$3::$4=vsum(@<<..@>>);f-2

** Comentarios del docente
- Un microprocesador no est谩 /dise帽ado para realizar las tareas espec铆ficas
  del sistema embebido/: Un microprocesador es una m谩quina de prop贸sito
  general (excepto casos muy espec铆ficos, pero... hace falta muuuuuucho
  para que una idea cualquiera que tenemos de automatizaci贸n o lo que sea
  amerite el dise帽o de un procesador acorde )
  - Tampoco /gestiona los recursos/: Eso lo hace el sistema operativo
    (software) que corre en dicho equipo. El procesador simplemente va
    ejecutando siempre la siguiente instrucci贸n, a ciegas y sin preguntar.
- Ummm... Generaron el video sin verificar que estuviera capturando la
  salida de su terminal 
  - La 煤nica interacci贸n que vimos es la que presentaron como capturas de
    pantalla como parte de la presentaci贸n 
  - Pero los dos fragmentos m谩s interesantes no aparecen en el video que
    compartieron 
- 驴 =bs=4M= para el =dd=? 隆Uy, qu茅 atascados!  Yo me siento muy atascado
  por usar =256K=...
  - Sugiero que cuando usan =dd= usen la opci贸n =oflags=dsync=; esto hace
    que cada llamada de escritura vaya seguida de un =sync()=, lo cual no
    煤nicamente les ahorra el correr el =sync()= final, sino que va
    reportando 
- Les dejo una liga que puede interesarles como ejemplo de /IoT/ y de
  /automatizaci贸n de casa/: Mi amigo Jonathan McDowell est谩 construyendo un
  asistente de voz similar a los /Alexa/ ([[https://www.earth.li/~noodles/blog/2025/04/voice-assistant-atom-echo.html][parte 1]], [[https://www.earth.li/~noodles/blog/2025/05/voice-assistant-whisper.html][parte 2]]), con
  reconocimiento de voz, y con capacidad de controlar los [[https://www.earth.li/~noodles/blog/tags/homeautomation/][diversos
  componentes de su automatizaci贸n de casa]].
